tools/loadtest/artillery.config.yml
# Performance Testing Configuration

# Artillery Load Testing Configuration

config:
  # Target API server
  target: "http://localhost:3000/api"

  # HTTP processor configuration
  processor: "./artillery-processor.js"

  # Load testing phases
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 120
      arrivalRate: 10
      name: "Load test"
    - duration: 60
      arrivalRate: 20
      name: "Peak load"
    - duration: 60
      arrivalRate: 50
      name: "Stress test"

scenarios:
  # Authentication endpoints
  - name: "Session Management"
    weight: 10
    flow:
      - get:
          url: "/api/auth/session"
          expect:
            - statusCode: 200
            - hasProperty: "success"
      - post:
          url: "/api/auth/biometric"
          headers:
            Content-Type: "application/json"
          json:
            credentialId: "test-credential"
          expect:
            - statusCode: 200
            - hasProperty: "success"

  # Units management
  - name: "Units CRUD Operations"
    weight: 30
    flow:
      - get:
          url: "/api/units"
          expect:
            - statusCode: 200
            - hasProperty: "data"
      - post:
          url: "/api/units"
          headers:
            Content-Type: "application/json"
            x-csrf-token: "{{ csrfToken }}"
          json:
            code: "COMP101"
            name: "Test Unit Load"
            color: "#FF5733"
          description: "Load test unit"
      - put:
          url: "/api/units/{{ createUnitResponse.data.id }}"
          headers:
            Content-Type: "application/json"
            x-csrf-token: "{{ csrfToken }}"
          json:
            name: "Updated Unit Load"
            description: "Updated load test unit"
      - delete:
          url: "/api/units/{{ getRandomUnitId() }}"
          expect:
            - statusCode: 200

  # Deadlines management
  - name: "Deadlines CRUD Operations"
    weight: 30
    flow:
      - get:
          url: "/api/deadlines"
          expect:
            - statusCode: 200
            - hasProperty: "data"
      - post:
          url: "/api/deadlines"
          headers:
            Content-Type: "application/json"
            x-csrf-token: "{{ csrfToken }}"
          json:
            title: "Load Test Deadline"
            due_date: "2024-12-15T23:59:59Z"
            priority: "High"
            type: "Assignment"
      - put:
          url: "/api/deadlines/{{ getRandomDeadlineId() }}"
          json:
            completed: true
            title: "Completed Load Test Deadline"

  # Mixed operations (stress test)
  - name: "Mixed Operations"
    weight: 20
    flow:
      - get:
          url: "/api/units"
          expect:
            - statusCode: 200
      - post:
          url: "/api/units"
          json:
            code: "MIXED_STRESS"
            name: "Mixed operation unit"
      - get:
          url: "/api/deadlines"
          expect:
            - statusCode: 200
      - post:
          url: "/api/notifications"
          json:
            title: "Stress test notification"
            message: "High load test notification"

# Performance criteria
# payload:
#   # Target response times (95th percentile)
#   - http:
#       response_time: 300
#   - response_time: 500
#       response_time: 1000
#   - response_time: 2000
#
#   # Target error rates
#   - error_rate: 0.01  # 1%
#   - error_rate: 0.05  # 5%

# Metrics collection
processor:
  path: "./artillery-processor.js"